Repository: ahesford/x2goserver
Catalog: debian/po/*.po
Languages: cs

source: X2Go Server / PostgreSQL Upgrade
cs: Aktualizace X2Go Server / PostgreSQL

source: You have configured X2Go Server with PostgreSQL as session DB backend and you are upgrading x2goserver from a version minor to 3.1.0.0.
cs: Váš X2Go Server používá pro ukládání informací o X2Go relacích databázový server PostgreSQL a pokoušíte se aktualizovat x2goserver z verze nižší než 3.1.0.0.

source: Please follow these PostgreSQL DB upgrade instructions before you continue using your X2Go Server: /usr/share/doc/x2goserver/README.upgrade-pgsql-database.gz
cs: Před dalším používáním X2Go Server prosím postupujte podle následujících instrukcí pro aktualizací databáze: /usr/share/doc/x2goserver/README.upgrade-pgsl-database.gz

source: X2Go Server Upgrade
cs: Aktualizace X2Go Server

source: You are upgrading from an X2Go Server version (< 4.1.0.0). Between 4.1.0.0 and 4.0.0.x the package structure has undergone a major change.
cs: Aktualizujete X2Go Server z verze nižší než 4.1.0.0. Od verze 4.0.0.x došlo v balíčku k výrazným změnám.

source: Note that most of the Perl code in X2Go Server has been moved into its own Perl API X2Go::Server.
cs: Většina X2Go Server kódu psaném v Perlu byla přesunuta do nového Perl API X2Go::Server.

source: Create group for X2Go Desktop Sharing now?
cs: Chcete nyní vytvořit skupinu pro X2Go Desktop Sharing?

source: In X2Go Desktop Sharing users gain the privilege to share one another's X2Go/X11 desktop session by being members of a common POSIX group. The POSIX group being used for this can be configured system-wide and on a per user basis.
cs: X2Go Desktop Sharing umožňuje uživatelům na základě členství ve standardní uživatelské skupině sdílet X2Go/X11 relace ostatních uživatelů. Skupinu, jež toto oprávnění bude poskytovat, lze nastavit centrálně pro celý systém, ale také zvlášť pro každého uživatele.

source: In X2Go Desktop Sharing's user configuration you can adjust what group to use for this later on. Here, you are asked for the system-wide default.
cs: V konfiguraci X2Go Desktop Sharing uživatele můžete zvolit skupinu pro sdílení později. Zde zadejte výchozí systémovou skupinu.

source: If this group is not created now, you should assign this desktop sharing privilege to an already existing group on the next screen.
cs: Není-li tato skupina vytvořena, měli byste oprávnění X2Go Desktop Sharing na další obrazovce přiřadit již existující skupině.

source: If this group is not created / not assigned, users will not be able to share X2Go/X11 desktop sessions with each other.
cs: Pokud tato skupina neexistuje nebo není přiřazena, uživatelé nebudou mít možnost sdílet své X2Go/X11 relace s ostatními.

source: Use already existing groups for X2Go Desktop Sharing?
cs: Chcete pro X2Go Desktop Sharing použít již existující skupiny?

source: If a group appropriate for being assigned the desktop sharing privilege has already been created (e.g. in an LDAP user/group database) then you can specify this group name on the next screen.
cs: Pokud už je skupina pro X2Go Desktop Sharing oprávnění vytvořena (např. v LDAP), můžete ji zadat na příští obrazovce.

source: Assign X2Go Desktop Sharing privilege to POSIX group:
cs: Přiřadit X2Go Desktop Sharing oprávnění skupině:

source: Please specify the name of the POSIX group that you want to assign the X2Go Desktop Sharing privilege to.
cs: Prosím zadejte název skupiny, které chcete přiřadit oprávnění X2Go Desktop Sharing.

source: If you leave this empty, the "root" group will be used.
cs: Pokud nic nezadáte, použije se skupina "root".

source: Delete the group that was formerly used for this?
cs: Smazat dříve použitou skupinu?

source: The group for the X2Go Desktop Sharing privilege has been modified.
cs: Skupina s oprávněním X2Go Desktop Sharing byla změněna.

source: Please specify whether the old group should be deleted. If unsure, keep the formerly used group and manually investigate later.
cs: Prosím vyberte, zda má být dříve použitá skupina odstraněna. Pokud si nejste jistí, nemažte ji.

source: Non-existing group
cs: Neexistující skupina

source: The given group does not exist on this system. You should specify an already existing group.
cs: Zadaná skupina v systému neexistuje. Prosím zadejte již existující skupinu.

source: Auto-start X2Go Desktop Sharing applet on desktop session startup?
cs: Spouštět X2Go Desktop Sharing applet automaticky při spuštění relace?

source: For an X2Go/X11 desktop session to be accessible via X2Go Desktop Sharing, the X2Go Desktop Sharing applet needs to be running. It advertises the users X2Go/X11 session through an access controlled socket to X2Go client applications.
cs: Aby bylo možné sdílet relace, musí být spuštěný X2Go Desktop applet. Ten poté oznamuje dostupnost sdílených X2Go/X11 relací klientským aplikacím X2Go.

source: The applet can be configured to start automatically on desktop session startup, but for security reasons this is not the default.
cs: Applet lze spouštět automaticky při startu relace. Z bezpečnostních důvodů to ovšem není výchozí nastavení.

source: Auto-activate X2Go Desktop Sharing on desktop session startup?
cs: Aktivovat X2Go Desktop Sharing automaticky při spuštění relace?

source: The X2Go Desktop Sharing applet normally starts in non-sharing mode (users that request to share the running desktop session get auto-rejected). The user normally has to actively activate the sharing mode in the applet's GUI.
cs: X2Go Desktop Sharing applet se standardně spouští v zakázaném režimu (připojení k běžící relaci bude zamítnuto). Uživatel relace musí sám povolit sdílení relace v appletu.

source: If you enabled the auto-start option in the previous screen, you can additionally choose here, if desktop sharing shall be activated when the X2Go Desktop Sharing applet is auto-started at session logon.
cs: Pokud jste povolili automatický start na předchozí obrazovce, můžete nyní povolit také automatickou aktivaci X2Go Desktop Sharing po spuštění relace.

source: For security and data protection reasons, this is not the default. Use this auto-activation feature only in appropriate environments (e.g. on class room computers).
cs: Z důvodu bezpečnosti a ochrany dat není automatická aktivace povolena ve výchozím nastavení. Používejte pouze ve vhodných prostředích (např. na počítačích v učebnách).
